test/multiphase/reactingTwoPhaseEulerFoam/populationBalance/negativeDrift/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    massSource1
    {
        type            scalarSemiImplicitSource;

        selectionMode   all;
        volumeMode      specific;

        injectionRateSuSp
        {
            thermo:rho.air     (-0.0258575 0); // kg/s/m³
            thermo:rho.water    (25.8575 0); // kg/s/m³
        }
    }
}


// ************************************************************************* //
